{
    "header": {
        "home": "Home",
        "sobre": "About",
        "habilidades": "Skills",
        "projetos": "Projects",
        "contato": "Contact"
    },
    "user": {
        "desc": "I am a developer with experience in analysis, development, and maintenance of corporate systems, working on solutions that involve JavaScript, jQuery, Bootstrap, SQL (MySQL/SQL Server), as well as consuming APIs and Web Services (SOAP/REST). I have experience with agile methodologies and participation in all stages of projects, from requirements gathering to final delivery and user support. Throughout my career, I have worked on integration and automation projects within the TOTVS Fluig, RM, and Protheus ecosystems, always aiming to align technology and business processes to generate efficiency and results. This experience gave me direct contact with BPM workflows, user management, SQL queries, and system integrations, in addition to strengthening my ability to act as a bridge between technical and operational areas. My focus is to continue expanding my expertise as a developer, exploring new technologies and frameworks, while keeping as a differential my ability to deliver practical solutions in complex corporate environments.",
        "fullstack": "BPMN",
        "fluig": "Fluig",
        "software": "Software",
        "frontend": "Front-end"
    },
    "home": {
        "desenvolvedor": "Developer",
        "btnTexto01": "Download Resume",
        "btnTexto02": "Get in Touch"
    },
    "destaquesSecao": {
        "titulo": "Highlights",
        "subtitulo": "Here are some of my main works.",
        "btnTexto": "View All Projects"
    },
    "footer": {
        "navegacao": "Navigation",
        "conecte": "Connect",
        "direitos": "All rights reserved."
    },
    "projetosSecao": {
        "titulo": "My Projects",
        "subtitulo": "Take a look at some of my projects.",
        "filtros": {
            "all": "All"
        }
    },
    "sobreSecao": {
        "titulo": "About Me"
    },
    "experienciaSecao": {
        "titulo": "Experience",
        "subtitulo": "Here’s a little about my journey."
    },
    "habilidadesSecao": {
        "titulo": "My Skills",
        "subtitulo": "Here are some of my technical skills.",
        "filtros": {
            "todos": "All",
            "frontend": "Frontend",
            "backend": "Backend",
            "mobile": "Mobile",
            "database": "Database",
            "devops": "DevOps",
            "testing": "Testing",
            "design": "Design",
            "tools": "Tools",
            "outros": "Others"
        }
    },
    "estatisticasSecao": {
        "titulo": "Statistics",
        "estatisticas": {
            "projetos": "Projects",
            "anos": "Years",
            "clientes": "Clients",
            "dedicacao": "Dedication",
            "satisfacao": "Client Satisfaction"
        }
    },
    "projetoModal": {
        "sobre": "About the Project",
        "tecnologias": "Technologies Used",
        "btnTexto01": "View Online",
        "btnTexto02": "View Code"
    },
    "contatoSecao": {
        "titulo": "Contact",
        "subtitulo": "Did you like what you saw? Reach out through one of these channels.",
        "cardEmail": {
            "titulo": "Send Your Message",
            "labelNome": "Name",
            "labelTelefone": "Phone",
            "labelMensagem": "Message",
            "btnTexto": "Send Message"
        },
        "titulo02": "Connect Via",
        "alert": "Please fill in all fields to send the message"
    },
    "chat": {
        "titulo": "Personal Assistant",
        "placeholder": "Type your message...",
        "mensagemInicial": "Hello! How can I help you today? Ask me anything about Guilherme."
    },
    "servicosSecao": {
        "titulo": "My Services",
        "subtitulo": "Complete solutions to turn your ideas into digital reality."
    },
    "servicos": {
        "sites": {
            "titulo": "Website Development",
            "descricao": "Modern, responsive, and optimized institutional websites for your company"
        },
        "landing": {
            "titulo": "Landing Pages",
            "descricao": "High-conversion pages optimized to increase your sales and leads"
        },
        "ecommerce": {
            "titulo": "E-commerce",
            "descricao": "Complete online stores with payment systems and product management"
        },
        "linkBio": {
            "titulo": "Link in Bio",
            "descricao": "Personalized pages to centralize all your links and social media"
        },
        "manutencao": {
            "titulo": "Maintenance",
            "descricao": "Technical support, updates, and continuous improvements for your website"
        },
        "fluig": {
            "titulo": "Fluig Solutions",
            "descricao": "Solutions for the TOTVS FLUIG system, including automations and integrations"
        },
        "bpmn": {
            "titulo": "BPMN",
            "descricao": "Business process modeling and automation to optimize operations"
        },
        "personalizado": {
            "titulo": "Custom Project",
            "descricao": "Tailor-made solutions for specific business needs"
        }
    },
    "experiencias": {
        "experiencia01": {
            "papel": "Systems Analyst",
            "empresa": "Compila Soluções em Tecnologia",
            "descricao": "Responsible for the maintenance and development of corporate systems using JavaScript, HTML, jQuery, and Bootstrap. Perform SQL queries, system integrations with TOTVS Protheus, as well as providing user support and handling tickets. Work with agile methodologies to ensure deliveries aligned with company needs.",
            "tipo": "Work"
        },
        "experiencia02": {
            "papel": "Systems Assistant",
            "empresa": "Reframax Engenharia Ltda",
            "descricao": "Responsible for maintaining software with JavaScript, HTML, jQuery, and Bootstrap, as well as SQL queries and system integration with TOTVS RM. Worked on user management in the Fluig platform and provided technical support, using agile methodologies to meet business needs.",
            "tipo": "Work"
        },
        "experiencia03": {
            "papel": "Systems Intern",
            "empresa": "Reframax Engenharia Ltda",
            "descricao": "Assisted in supporting and maintaining corporate software, focusing on JavaScript, HTML, jQuery, and Bootstrap. Participated in user management activities in Fluig, provided technical support, and worked with agile methodologies alongside the team.",
            "tipo": "Work"
        },
        "experiencia04": {
            "papel": "IT Apprentice",
            "empresa": "Reframax Engenharia Ltda",
            "descricao": "Provided technical support to users, including computer formatting, user management, and incident resolution. This experience consolidated my foundation in IT infrastructure and support.",
            "tipo": "Work"
        },
        "experiencia05": {
            "papel": "Software Engineering Undergraduate",
            "empresa": "PUC Minas",
            "descricao": "Project-oriented education, with a solid foundation in software architecture, data structures, databases, and artificial intelligence fundamentals. Emphasis on development best practices such as code versioning, automated testing, agile methodologies, and CI/CD.",
            "tipo": "Study"
        },
        "experiencia06": {
            "papel": "Computer Engineering Undergraduate",
            "empresa": "PUC Minas",
            "descricao": "Project-oriented education, with a solid foundation in software architecture, data structures, databases, and artificial intelligence fundamentals. Emphasis on development best practices such as code versioning, automated testing, agile methodologies, and CI/CD.",
            "tipo": "Study"
        }
    },
    "projects": {
        "btnTexto": "View Details",
        "types": {
            "sites": "Websites",
            "landing": "Landing Pages",
            "apps": "Applications",
            "ecommerce": "E-Commerce",
            "others": "Others"
        },
        "status": {
            "inProgress": "In Progress",
            "done": "Completed"
        },
        "catalogoFilmes": {
            "title": "Movie Catalog",
            "description": "A movie catalog project, developed to allow users to browse the most popular titles of today and also search for any movie of their choice. The application provides relevant information such as trailer, release date, duration, revenue, budget, and description, offering a complete browsing experience."
        },
        "Secret Word": {
            "title": "Secret Word",
            "description": "Secret Word is a project developed in React. The project is designed to be a virtual hangman game. With this project, I aim to study state management of elements, practice using React hooks, and further develop programming logic. A word and category are randomly selected, and the user must guess the letters in the word. Each correct guess adds 100 points, but after 5 incorrect guesses, the game ends and displays the final score."
        },
        "NutriSmart": {
            "title": "NutriSmart",
            "description": "NutriSmart is a platform designed for people who want to adopt a healthier lifestyle, including those who are overweight, undernourished, have dietary restrictions, or simply want better diet organization. With NutriSmart, users can create personalized diets according to their goals, receiving specific guidance to achieve them. The platform includes smart reminders to maintain regularity in meals and hydration throughout the day. It also features a scoring system that makes progress more motivating, allowing users to track results through a detailed dashboard. Additionally, it provides a section with educational videos on health, wellness, and lifestyle practices. NutriSmart transforms health care into a simple, practical, and inspiring experience."
        }
    }
}
