{
    "header": {
        "home": "Home",
        "sobre": "Sobre",
        "habilidades": "Habilidades",
        "projetos": "Projetos",
        "contato": "Contato"
    },
    "user": {
        "desc": "Sou desenvolvedor com experiência em análise, desenvolvimento e manutenção de sistemas corporativos, atuando em soluções que envolvem JavaScript, jQuery, Bootstrap, SQL (MySQL/SQL Server), além do consumo de APIs e Web Services (SOAP/REST). Tenho vivência em metodologias ágeis e participação em todas as etapas de projetos, desde o levantamento de requisitos até a entrega final e suporte ao usuário. Ao longo da minha trajetória, trabalhei em projetos de integração e automação dentro dos ecossistemas TOTVS Fluig, RM e Protheus, sempre buscando alinhar tecnologia e processos de negócio para gerar eficiência e resultados. Essa experiência me proporcionou contato direto com workflows BPM, gestão de usuários, consultas SQL e integrações entre sistemas, além de fortalecer minha habilidade de atuar como ponte entre áreas técnicas e operacionais. Meu foco é continuar ampliando minha atuação como desenvolvedor, explorando novas tecnologias e frameworks, mas mantendo como diferencial a capacidade de entregar soluções práticas em ambientes corporativos complexos.",
        "fullstack": "de BPMN",
        "fluig": "Fluig",
        "software": "de Software",
        "frontend": "Front-end"
    },
    "home": {
        "desenvolvedor": "Desenvolvedor",
        "btnTexto01": "Baixar Currículo",
        "btnTexto02": "Entrar em Contato"
    },
    "destaquesSecao": {
        "titulo": "Meus Destaques",
        "subtitulo": "Veja aqui alguns dos meus principais trabalhos.",
        "btnTexto": "Ver Todos os Projetos"
    },
    "footer": {
        "navegacao": "Navegação",
        "conecte": "Conecte-se",
        "direitos": "Todos os direitos reservados."
    },
    "projetosSecao": {
        "titulo": "Meus Projetos",
        "subtitulo": "Veja aqui um pouco dos meus projetos.",
        "filtros": {
            "all": "Todos"
        }
    },
    "sobreSecao": {
        "titulo": "Sobre Mim"
    },
    "experienciaSecao": {
        "titulo": "Experiências",
        "subtitulo": "Veja aqui um pouco sobre a minha jornada."
    },
    "habilidadesSecao": {
        "titulo": "Minhas Habilidades",
        "subtitulo": "Veja aqui um pouco das minhas habilidades técnicas.",
        "filtros": {
            "todos": "Todos",
            "frontend": "Frontend",
            "backend": "Backend",
            "mobile": "Mobile",
            "database": "Database",
            "devops": "DevOps",
            "testing": "Testing",
            "design": "Design",
            "tools": "Tools",
            "outros": "Outros"
        }
    },
    "estatisticasSecao": {
        "titulo": "Estatísticas",
        "estatisticas": {
            "projetos": "Projetos",
            "anos": "Anos",
            "clientes": "Clientes",
            "dedicacao": "Dedicação",
            "satisfacao": "Satisfação do Cliente"
        }
    },
    "projetoModal": {
        "sobre": "Sobre o Projeto",
        "tecnologias": "Tecnologias Utilizadas",
        "btnTexto01": "Ver Online",
        "btnTexto02": "Ver Código"
    },
    "contatoSecao": {
        "titulo": "Contatos",
        "subtitulo": "Gostou do que viu? Me chame por um desses canais.",
        "cardEmail": {
            "titulo": "Envie sua mensagem",
            "labelNome": "Nome",
            "labelTelefone": "Telefone",
            "labelMensagem": "Mensagem",
            "btnTexto": "Enviar Mensagem"
        },
        "titulo02": "Conecte-se Por",
        "alert": "Por Favor preencha todas os campos para enviar a mensagem"
    },
    "chat": {
        "titulo": "Assistente Pessoal",
        "placeholder": "Digite sua mensagem...",
        "mensagemInicial": "Olá! Como posso ajudar hoje? Pergunte qualquer coisa sobre o Guilherme."
    },
    "servicosSecao": {
        "titulo": "Meus Serviços",
        "subtitulo": "Soluções completas para transformar suas ideias em realidade digital."
    },
    "servicos": {
        "sites": {
            "titulo": "Criação de Sites",
            "descricao": "Sites institucionais modernos, responsivos e otimizados para sua empresa"
        },
        "landing": {
            "titulo": "Landing Pages",
            "descricao": "Páginas de conversão otimizadas para aumentar suas vendas e leads"
        },
        "ecommerce": {
            "titulo": "E-commerces",
            "descricao": "Lojas virtuais completas com sistema de pagamentos e gestão de produtos"
        },
        "linkBio": {
            "titulo": "Link na Bio",
            "descricao": "Páginas personalizadas para centralizar todos seus links e redes sociais"
        },
        "manutencao": {
            "titulo": "Manutenção",
            "descricao": "Suporte técnico, atualizações e melhorias contínuas para seu site"
        },
        "fluig": {
            "titulo": "Soluções Fluig",
            "descricao": "Soluções para o Sistema TOTVS FLUIG, incluindo automações e integrações"
        },
        "bpmn": {
            "titulo": "BPMN",
            "descricao": "Modelagem e automação de processos de negócio para otimizar operações"
        },
        "personalizado": {
            "titulo": "Projeto Personalizado",
            "descricao": "Soluções sob medida para necessidades específicas do seu negócio"
        }
    },
    "experiencias": {
        "experiencia01": {
            "papel": "Analista de Sistemas",
            "empresa": "Compila Soluções em Tecnologia",
            "descricao": "Atuo na manutenção e desenvolvimento de softwares corporativos utilizando JavaScript, HTML, jQuery e Bootstrap. Realizo consultas SQL, integrações de sistemas com TOTVS Protheus, além de oferecer suporte aos usuários e atendimento de chamados. Trabalho com metodologias ágeis para garantir entregas alinhadas às demandas da empresa.",
            "tipo": "Trabalho"
        },
        "experiencia02": {
            "papel": "Assistente de Sistemas",
            "empresa": "Reframax Engenharia Ltda",
            "descricao": "Responsável pela manutenção de softwares com JavaScript, HTML, jQuery e Bootstrap, além de consultas SQL e integração de sistemas com TOTVS RM. Atuei no gerenciamento de usuários na plataforma Fluig e ofereci suporte técnico, utilizando metodologias ágeis para atender às necessidades do negócio.",
            "tipo": "Trabalho"
        },
        "experiencia03": {
            "papel": "Estagiário de Sistemas",
            "empresa": "Reframax Engenharia Ltda",
            "descricao": "Atuei no suporte e manutenção de softwares corporativos, com foco em JavaScript, HTML, jQuery e Bootstrap. Participei de atividades de gerenciamento de usuários no Fluig, além de oferecer suporte técnico e atuar com metodologias ágeis em conjunto com a equipe.",
            "tipo": "Trabalho"
        },
        "experiencia04": {
            "papel": "Aprendiz de TI",
            "empresa": "Reframax Engenharia Ltda",
            "descricao": "Atuei no suporte técnico aos usuários, com atividades de formatação de computadores, gerenciamento de usuários e resolução de incidentes. Essa experiência consolidou minha base em infraestrutura e atendimento.",
            "tipo": "Trabalho"
        },
        "experiencia05": {
            "papel": "Graduando em Engenharia de Software",
            "empresa": "PUC Minas",
            "descricao": "Formação orientada a projetos, com base sólida em arquitetura de software, estruturas de dados, bancos de dados e fundamentos de inteligência artificial. Ênfase em boas práticas de desenvolvimento, como versionamento de código, testes automatizados, metodologias ágeis e CI/CD.",
            "tipo": "Estudo"
        },
        "experiencia06": {
            "papel": "Graduando em Engenharia de Computação",
            "empresa": "PUC Minas",
            "descricao": "Formação orientada a projetos, com base sólida em arquitetura de software, estruturas de dados, bancos de dados e fundamentos de inteligência artificial. Ênfase em boas práticas de desenvolvimento, como versionamento de código, testes automatizados, metodologias ágeis e CI/CD.",
            "tipo": "Estudo"
        }
    },

    "projects": {
        "btnTexto": "Ver Detalhes",
        "types": {
            "sites": "Sites",
            "landing": "Landing Pages",
            "apps": "Aplicativos",
            "ecommerce": "E-Commerce",
            "others": "Outros"
        },
        "status": {
            "inProgress": "Em Andamento",
            "done": "Finalizado"
        },
        "catalogoFilmes": {
            "title": "Catálogo de Filmes",
            "description": "Projeto de um catálogo de filmes, desenvolvido com o objetivo de permitir que o usuário navegue pelos títulos mais populares da atualidade e também pesquise pelo filme de sua escolha. A aplicação fornece diversas informações relevantes, como trailer, data de lançamento, duração, faturamento, orçamento e descrição, oferecendo uma experiência completa de consulta."
        },
        "Secret Word": {
            "title": "Secret Word",
            "description": "O SecretWord é um projeto desenvolvido em React. Este projeto tem a proposta de ser um jogo da forca virtual. Por meio desse projeto pretendo estudar principalmente o controle de estado dos elementos do projeto, além de utilizar mais hooks presentes no React e desenvolver mais a lógica de programação por trás do projeto. Deverá ser sorteada uma palavra e uma categoria de palavras, o usuário deverá tentar acertar as letras que estão presentes nas palavras, a cada palavra acertada a pontuação vai aumentar 100 pontos, mas se o usuário errar 5 letras a forca vai para a tela final que mostra a pontuação total obtida e encerra o jogo."
        },
        "NutriSmart": {
            "title": "NutriSmart",
            "description": "NutriSmart é uma plataforma projetada para pessoas que desejam adotar uma vida mais saudável, incluindo aquelas com sobrepeso, subnutrição, restrições alimentares ou que buscam organizar melhor suas dietas. Com o NutriSmart, é possível criar dietas personalizadas de acordo com suas metas, recebendo orientações específicas para alcançar seus objetivos. A plataforma conta com lembretes inteligentes que ajudam a manter a regularidade na alimentação e na hidratação ao longo do dia. Além disso, oferece um sistema de pontuação que torna o progresso ainda mais motivador, permitindo acompanhar seus resultados por meio de um painel detalhado. Para complementar, disponibiliza uma seção com vídeos educativos sobre saúde, bem-estar e práticas para uma vida equilibrada. NutriSmart transforma o cuidado com a saúde em uma experiência simples, prática e inspiradora."
        }
    }
}